# bot_config.py

api_id = 26385587
api_hash = "16d49573d64611b9c14371d538aec716"

KEYWORDS = [
    "обменять рупии", "обменять", "рупии", "рубли", "idr", "обмен",
    "поменяю", "меняет", "рубли рупии", "рупии рубли", "обменник", "курсу",
    "хороший курс", "ищу обмен", "обмен валют", "на карту", "перевод",
    "переводом", "переведу", "наличные", "менялы", "меняла", "доллары", "usd"
]

TRAINER_KEYWORDS = [
    "спортзал", "тренировки", "тренер", "тренировки онлайн", "тренер онлайн",
    "расчет питания", "качалка", "подсушиться", "набрать", "похудеть",
    "тренер оффлайн", "тренер чангу", "тренировки чангу",
    "ищу тренера", "нужен тренер", "ищу тренировки", "хочу тренироваться",
    "персональные тренировки", "фитнес тренер", "посоветуйте тренера"
]

TARGET_CHAT = "@trenersharko"
IGNORED_USERS_FILE = "ignored_users.txt"
EXTRA_KEYWORDS_FILE = "extra_keywords.txt"
